using System;
using System.Collections.Generic;
using System.Linq;

namespace Wacton.Desu.Tests.Radicals
{
    public static class TestEntries
    {
        public static IEnumerable<string> Kanji䯂() => null;
        public static IEnumerable<string> Kanji亀() => AsArray("亀 田 勹 乙");
        public static IEnumerable<string> Kanji彁() => AsArray("弓 口 亅 一");
        public static IEnumerable<string> Kanji鰹() => AsArray("魚 臣 田 土 又 杰");
        public static IEnumerable<string> Kanji夊() => AsArray("夂");
        public static IEnumerable<string> Kanji亜() => AsArray("｜ 一 口");
        public static IEnumerable<string> Kanji熙() => AsArray("杰 已 匚 口");
        public static IEnumerable<string> Kanji丂() => AsArray("一 勹");
        public static IEnumerable<string> Kanji龥() => AsArray("一 ｜ 亅 个 ハ 冂 口 廾 目 冊 貝 頁 龠");

        public static IEnumerable<string> Radical一() => AsArray(
            "亜唖阿姶悪芦或袷夷椅畏異遺井郁一芋蔭陰右窺丑云雲盈益榎円延援演塩汚央岡下" +
            "何可夏寡歌河珂苛荷華嘩画悔開碍垣劃隔岳橿恰且樺釜栢萱瓦乾寒干桓漢環看緩還" +
            "関含基奇寄希棄稀貴輝騎儀宜犠義蟻誼議丘朽求給虚亨供共彊興尭業極桐僅勤琴衿" +
            "吟倶駈具勲君薫群郡刑啓型形恵慧荊倹兼券喧圏拳捲研肩遣乎戸雇顧互碁乞光后宏" +
            "巧恒晃更梗構洪溝硬紘綱肱講購閤号合今佐左査再最塞妻才犀在材財肴咲崎埼碕作" +
            "柵冊三参惨珊蚕伺使司嗣屍師施死至詞事慈滋爾璽磁雫写斜遮若惹寿拾重春所叙序" +
            "徐除傷症称証象鉦上丈丞乗剰場擾杖畳蒸飾慎晋榛真秦甚笥垂睡衰錘随髄世征政整" +
            "正席惜昔籍宣扇煎煽箭前岨措狙疎祖租粗組阻創倉喪奏爽曹槍槽漕争糟葬蒼送遭鎗" +
            "像束速袖其揃存唾堕惰楕体帯戴泰宅托託諾但巽丹嘆坦担旦歎湛胆壇断暖檀段値置" +
            "窒昼苧貯丁庁暢町腸頂勅直朕鎮陳槻椿潰壷低停汀訂釘鼎迭典天展添殿澱塗途砺度" +
            "凍唐塔塘搭東棟湯灯答筒董蕩藤謄騰働動同洞胴銅峠得凸寅乍弐廿禰寧年念捻乃嚢" +
            "濃膿農覗廃拝杯盃曝爆函肇鉢髪蛤挽否扉畢逼紐百評病蛭浜賓瓶不富冨布怖普譜撫" +
            "舞蕪副復幅福腹淵糞丙併兵塀柄並閉偏篇編遍便鞭俸奉峰峯捧縫蓬蜂豊鋒房暴棒奔" +
            "本鮪柾俣抹末万満湊蓑稔無命免餅戻矢鑓愉愈諭輸佑優友宥憂有祐郵雄予余与誉預" +
            "揚楊陽翼欄蘭吏了両糧量領倫臨輪涙令伶冷嶺怜玲苓鈴零霊麗齢煉錬炉婁蝋論歪賄" +
            "亙亘弌丐丕亊亞亳亶仗佇佩佰侑來侖倚會偈偸僉僵儉兀兩兪册冉冓冱剏剄剞剪剳劍" +
            "劔劒匐匱匳卅卍厦叮咀哄哈哥唏哽唸唳喘喩嗄嘸嚥囂囹囿圜圷坏垪堊堙塲墟壙壤壺" +
            "壼壽竒妲妍娉婀媾嫣孃孳孺實寰專尹屏岑妛岻峇峺崋嵜崙崘嶮巵帶并廈廡廳弖彁彌" +
            "徑忸忝恠怎怛恆恫惡惠愃愴慯慝憙憮懣戛戞扁拔抔拿拱拵掎掵捩揄搴搆搶擅舉攀敍" +
            "敘數斂昊昜晉晞晝暄暘曁曄曩朞朮朿杤枦枅柯檜桎栫梹梺椏棊棗棯椪椣棆楡寨樓橢" +
            "檢櫃檸欷欹歛歟殤氈沍洽浤涵淆淒淪湲湎滿渝滄滬滯澑澪濔瀑瀰瀲炳烝焉煖煬爨爰" +
            "犲狃猗獪獸璢瑜瑾瓸甦甼畫畭畸疆畴疔疸痞痾瘍瘉瘡瘻癸盒盪蘯盻眄瞞瞶瞼矗矜碣" +
            "祠祗祓禪禮禳秉秡秣稱穰窘窶竡笨笄箚篝簑簔篳簍篶簣簽籥粐粤粭粡粨粳鬻絨絣綺" +
            "綮綸綟緻縣縉縷繖繪罔罘羚羶翕翦翩聆聘胚隋腆胼膓膾膸臉與艙艚舮苒苴莓茉荐荅" +
            "莟莖茣荼萓菫蒹蓆蓴蔗蔕蕘薈薑藪藉乕號虱蚩蚌蚯蛉蛬蜍蝨蝙蝓蝪螻蠹衄衙衾袒裲" +
            "褄褊襄褸覦覯觴訶諠諞謌謇諡譁譴讌讓豺貪賚賽跚跋踰蹇蹌蹠蹣蹕軆輊輌輳辷邇逕" +
            "迸逾遘隨邱扈酊醋醢醴釀鈕錏鍮鎭鏤鈩鑰閂閧陏陲險霰靼鞳頷顫颪餘饉饋騁駢騙騫" +
            "驗髏髓髯鬟鯑鯰鱠鴒鴿鵲鷓黔黻齡龕龠堯槇丂丄丅丌丒丣两丰丵乁乇乴亯亹仃仛仠" +
            "仡仨仱仵仾仿伂伃伕伖你伳伹伻伾佂佈佣佮佱佽侁侄侉侊侌侗侟侼俁俅俉俌俒俜倁" +
            "倄倎倛倢倲倳倵偁偂偅偆偌偒偓偙偪偰偱傃傓傔傖傞僀僐僓僔僜僱儃儇儈儐儗儙儛" +
            "儜儞儧儭儯儱儳儴兂兏兓兕兤冝冡冭冺冾凂减凑凘凮凳刁刱刼剅剘剚剷剸劂劊劌劓" +
            "劖劘劥劶劷勄勌勩勪勬勶勷匀匌匬匲匼匾卌卋卙卡卣厇厈厔厷叀叚叠吂吓吴呞呭咑" +
            "咟咮咺哊哬哶哼哿唅唉唪唫啊啛啞啿喂喔喲嗆嗉嗌嗒嗛嗞嗶嘈嘍嘎嘑嘒嘳嘵嘻嘼嘽" +
            "噁噄噉噏噔噞噦噲嚅嚋嚌嚙嚝嚨嚩嚫嚭嚳嚷囊囏囍囙囥囨圇圊圑圚圛圢圪圴坅坍坥" +
            "坧坯坵坷坻坾垁垌垙垞垕垸埧埵堈埡堍堛堞堠堹堿塍塐塟塧墈墊墌墖墝墠墡墲壎壐" +
            "壔壖壡壩壳夆夒夓夔虁夤奡奣奫奭奯奵奼妋妌妒妗妤妰妳妷妺姃姈姍姝姤姧姮姯姷" +
            "娀娒娨娪娭婌婞婭婷婻婾媋媙媟媠媵媸媺媻嫠嫥嫮嫵嬈嬗嬴嬛嬝嬭孁孋孒宁宐宑宱" +
            "寗寘寠寴尗尟尫尬尮尰尲尵尶屙屜屢屧屨屰屼屽岝岢岴岺峒峝峱崤崴嵑嵊嵿嶁嶧嶫" +
            "嶹巃巎巘巙巠巩巹帀帮帲幋幐幉幘幞幪幬幰庢廌廔廕廥弇弎弮弻弽弿彀彅彍彘彤彧" +
            "彲彽彾徝徧徰忐忑忓忔忢忬忳怍怔怚怵恝恡悑悕悘悷悻惎惵惼惽愊愓愖愫愰愱慲慸" +
            "慻慼憃憒憓憜憠憨憸懀懁懂懜懝懞懟懢懧懩懯戣戫戹戽扃扆扚扤抦抨抶抷抺抿拖拼" +
            "挃挄挊挓挪挭捂捄捭捿掄掚掭掮揅揎揓揜揲揳揸揹搠搤搽搿摋摏摒摓摜摟摣摭摴撅" +
            "撘撝撿擄擐擥擰擻攁攉攏攓攙攦攮攼敃敔敟斁斅斒斠斲斿旂旉旎旐旖旟旰旴旿昀昈" +
            "昞昤昩昬昰昳晅晊晗晘晡晪晸暋暌暙暛暿曎曛曨曬朎朾杌杔杮枎枑枰枵枻枼枽柂柃" +
            "柈柒柦栔栟栨栯桄桊桛桮桱桺桻梂梆梈梚梣棏棙棨棫棬棰椖椱椵椸楂楅楉楦楩楱楲" +
            "榖榘榡榥榨榺槗槥樁樝樠樤樻樾橅橆橊橐橒橛橳檑檯檽櫌櫕櫜櫤櫬櫼欃欉欐欛欞欤" +
            "欵歖歝歵殂殛殢殨殬殭殮殹殽毉毌毚毧毹氂氐氶汔汛汫汯汴汻沔沗沲泆泍泜洊洦洧" +
            "汧洯洹浗浯浼涇涔涘涬淎淏淟淠淢淰渲湔湢湳湽溓溙溠溮溱滁滇滍滹漊漍漛漦漩潓" +
            "潝澍澐澓澚澦澮澰澵澶濨濽瀀瀗瀣瀹瀼灃灊灋灞炗烔烕烜烤焏煁煅煆煊煚煠煹熀熚" +
            "熢熯熺燁燙燸燾爗爚爝爟爯爴牁牃牏牖牱牼犄犛犴狉狟狳猂猓猘猞猤猵獟獧獩獫獮" +
            "獯獱獼玁玎玕玞珖珷珻琁琦琫瑃瑄瑇瑒瑧瑱瑲璇璏璑璮璯璵璹璿瓉瓌瓞瓤瓨瓪瓫瓯" +
            "瓴瓺瓻瓼瓿甆甒甖甗甹畇畐畱畺畻畼畽疅疙疜疴痄痌痏痗痡瘂瘇瘈瘊瘕瘛瘥瘩癊癁" +
            "癃癅癋癟癥皌皕皝皟皢皣皭皽盔盦盬盰眊眜眮眹睅睎睠睪睰睺睽瞔瞖瞚矃矉矤矦矪" +
            "矬矰矱矴矸矻砆砉砢砰砵硃硄硎硜硡硾碔碘碡碟碬碭碱碳磌磡礆礐礜礞礠礱礿祆祑" +
            "祩祫禌禓禛禫禱禴秠秪秫秱秼稉稌稧稫稴稵稹穙穥穪窬窹竆竑竩竱笔笧笪笭笮笴筠" +
            "筭箐箞箠箬箯箺箼箽篲篼簂簳簴簺籑籒籜籝籡籭籲糄糇糍糓糦糩糫紇紑絁絑絙絚絜" +
            "絧絰絺絻絿綁綆綋綞緎縀緪緱緶縑縗縝縠縧縨縬縯縳縶繄繐繢繥繮繯繾纁纕纚缻缽" +
            "缾缿罝罡罭罱罾羀羋羐羜羢羭翃翎翽翾翿耊耓耝耟耠耰耵耹耾聠聤聵肈肧肹脜脵脼" +
            "腠腧腩腷膁膐膆膖膞膮膴膻臏臝臰臵臶臸臹臿舔舡舢舨舲舴舺艃艄艅艆艋艎艏艑艖" +
            "艜艠艣艧艭芉芊芣芩芼芾苆苪苯茊茬茮茼荎莄莍莬菏菐荓菶菹萹葅葊葍葘葚葜葥葳" +
            "葴葶蒒蒩蒪蒴蒺蓧蓱蓻蓽蔧蔫蔶蕐蕢薉薟薧薴薽薾薿藇藊藎藼蘀蘍蘘蘙蘛蘞蘩虀虖" +
            "虗虘虡虣虷虺蚨蚱蚳蚵蛃蛕蚈蜮蜯蜽蝅蝻螄螆螌螓螠螣螬螮螾蟈蟎蟚蟢蟪蟱蟺蠉蠊" +
            "蠙蠒蠓蠚蠭蠮蠰蠲蠺衃衋衎衕衘衟衠袘袛袜袟袠袾裱裷褎褏褕褙褠褨褰褺襀襅襆襗" +
            "襢襫襳覉覔覥覷覼觥觩觭觱觳詅詍詝詥詵詷誒誙誷諈諔諗諴諵諶謆謭謼譃譆譓譞譣" +
            "譸譼譾讏谸谹谽豏豓豔豗豣豨豭豻豾貆貋貐賆賕賰賸賾贉趕趬趷跇跊跙跰趼跲踁踡" +
            "踦踱踳踸蹀蹁蹛蹜蹹蹺躚躛躧軇軏軨軰輈輞輧輺轃轘轝轞迀迊迕迣迤迮迵迶逘逬逿" +
            "遰邅邐邗邢邳邴邶邾郃郄郅郈郗鄀鄈鄢鄯鄴鄶鄼酈酭醎醡醭醰醳醶醻醼釂釃釬釮鈇" +
            "鈐鈜鈣鈳鈵鈼鉃鉇鉏鉰鉶鉼鉿銊銍銒銗銙銧銲銶鋂鋐鋘鋙錀錈錑錡錶鍑鍚鍥鍩鍭鍱" +
            "鍳鍽鍿鎋鎡鎤鎶鎺鎩鏄鏇鏊鏋鏷鏸鐂鐟鐮鐱鑈鑌鑡鑨鑯鑲镸镹镾閈閎闋闐闚闞闟闠" +
            "闤阢阱阷阸阼陁陘隂隃隤隯隳雘霉霳靊靕靗靣靧靪靮靻鞕鞢鞲鞶鞸鞼鞾韁韉韎韐韑" +
            "韘韝韠韡韯韱韴韸頇頙頜顑顢顣顪颫颴颺飅飡飣飥飦飧飪飳餂餇餈餑餕餖餗餚餛餜" +
            "餧餱餲餳餵餺餻餼饀饁饆饈饍饎饔饘饛饜饞饟饠馦馲馿駓駔駞駧駫騃騐騞騢騤騸驁" +
            "驊驑骵骶骾骿髐髒髕髩鬂鬈鬋鬌鬒鬠鬹鬺魖魗魣魳鮇鮝鮦鮩鮸鯁鯗鯳鯸鯿鰏鰑鰖鰘" +
            "鰙鰚鰜鰦鰧鰵鰷鰽鱁鱃鱄鱏鱔鱖鱞鱟鱣鱮鱵鴞鵃鵇鵶鶄鶬鶱鶼鶿鷇鷖鷟鷰鸇鸒鸙鸝" +
            "鹺鹻鹼黋黬黭黮黰黱鼂鼉鼏鼐鼑鼒鼯鼿齄齇齓齕齖齗齘齚齝齞齨齩齭齮齯齰齱齳齵" +
            "齺齽龏龐龑龒龔龖龗龞龡龢龣龥"
        );

        public static IEnumerable<string> Radical囗() => AsArray(
            "囲咽因姻園薗恩箇回廻菌圏鹸個固口国困梱四囚図団壇掴圃亶凅凛囗囮囹圀囿圄圉" +
            "圈國圍圓團圖嗇圜墻幗廩徊悃惱懍擅椢檣氈氤泗泅涸湎溷滷烟牆牘犢瑙痼碯稟禀穡" +
            "窗箘篦粤總續羶聰腦膕臘艢茵茴蓖薔蛔覿讀貔贖迴鄙錮鐓鑞顫駟鬣鰮鹵鹹鹽麕黷佪" +
            "傯儃冎剮啚囙囜囝囟囡囤囥囦囧囨囱囫园囶囷圁圂圇圊圌圑圕圚圝堌壈嬗嬙懎捆摑" +
            "撾朙棝檁洄漍澟澶濇爴牕璮皽睏硇磇磠祻稇稛簂絗絪綑胭膻莔蒽蟈蟺裀裍襢訵靣饘" +
            "駰鮰鯝鱣鸇鹺鹻鹼"
        );

        public static IEnumerable<string> Radical亀() => AsArray("穐竃亀縄蝿龝鬮龜蘒");
        public static IEnumerable<string> Radical鬯() => AsArray("鬱鬯");
        public static IEnumerable<string> Radical龠() => AsArray("籥鑰龠瀹爚禴籲鸙龡龢龣龥");
        public static IEnumerable<string> Radical䯂() => null;

        private static IEnumerable<string> AsArray(string input)
        {
            var split = input.Split(" ", StringSplitOptions.RemoveEmptyEntries);
            var withoutSpaces = string.Join("", split);
            return withoutSpaces.ToCharArray().Select(x => x.ToString());
        }

    }
}
